from settings import *

# Карта
game_map = [
    ["W", "W", "W", "W", "W", "W", "W", "W", "W", "W", "W", "W"],
    ["W", ".", ".", ".", ".", ".", ".", ".", ".", ".", ".", "W"],
    ["W", ".", ".", ".", ".", ".", ".", ".", ".", ".", ".", "W"],
    ["W", ".", ".", ".", ".", ".", ".", "W", "W", "W", ".", "W"],
    ["W", ".", ".", ".", ".", ".", ".", "W", "W", "W", ".", "W"],
    ["W", "W", "W", "W", "W", "W", ".", "W", "W", "W", ".", "W"],
    ["W", ".", ".", ".", ".", ".", ".", ".", ".", ".", ".", "W"],
    ["W", "W", "W", "W", "W", "W", "W", "W", "W", "W", "W", "W"]
]
# карта
world_map = set()

for j, row in enumerate(game_map):
    for i, char in enumerate(row):
        if char == "W":
            world_map.add((i * TILE, j * TILE))

